{
  "university education": {
    "description": "Enumeration of the universities attended by M3 and the degrees earned and key content of the education",
    "phd": {
      "university": "Lund University",
      "country": "Sweden",
      "degree": "Ph.D.",
      "field": "Computational Chemistry",
      "year-start": "2004",
      "month-start": "January",
      "year-conclude": "2008",
      "month-conclude": "January",
      "dissertation": "Development and Application of a First Principle Molecular Model for Solvent Effects",
      "advisor": "Prof. Gunnar Karlström",
      "url-dissertation": "https://www.lu.se/lup/publication/f80332c1-cd71-4a7f-81c2-a874663c2a4e",
      "description": "A four year Ph.D. program in computational chemistry with a focus on the development of a first principle molecular model for solvent effects. The model comprises a quantum mechanical description of the electronic structure of the solute in a condensed medium, most often an aqueous medium, but also air-water interfaces. The electronic structure is modelled as a multiconfigurational wave function in order to enable the description of non-ground state effects, e.g. excited states and chemical reactions. The solvent is described by a polarizable classical force field, and the statistical mechanical problem is solved through a Monte Carlo simulation. The model was formulated, developed, implemented and applied by M3. The preferred language for implementation was Fortran as dictated by the large legacy code base. C and Python were used to lesser extent. All done in a Unix environment. In addition to the model development, the Ph.D. program included a number of courses in quantum chemistry, statistical mechanics, intermolecular interactions, advanced molecular physics, and artificial neural networks. As part of the program, M3 also taught a number of courses in quantum chemistry and collodial chemistry."
    },
    "msc": {
      "university": "Lund University",
      "country": "Sweden",
      "degree": "M.Sc.",
      "field": "Mathematics and Chemistry",
      "year-start": "1998",
      "month-start": "September",
      "year-conclude": "2003",
      "month-conclude": "December",
      "description": "A five year program with a broad scientific and quantitative focus, in particular chemistry, physics, mathematics and statistics. Courses taken include: organic chemistry, inorganic chemistry, physical chemistry, colloidal chemistry, theoretical chemistry, calculus, algebra, complex analysis, ordinary differential equations, topology, probability theory, statistical inference, Fourier analysis, linear algebra, metalogic, molecular physics, statistical mechanics, quantum mechanics. Extra-curricular activities include a wide range of readings in history and philosophy."
    }
  },
  "mooc": {
    "description": "Enumeration of the massive open online courses (MOOCs) taken by M3 with certificates",
    "devops_swe": {
      "platform": "Coursera",
      "educator": "IBM",
      "course": "IBM DevOps and Software Engineering",
      "year-conclude": "2023",
      "month-conclude": "February",
      "url-certificate": "https://coursera.org/share/e5b65c681f6cf2a85f0e761394f57cf9",
      "description": "A multi-course specialization comprising courses 'Introduction to Test and Behavior Driven Development', 'Introduction to Agile Development and Scrum', 'Python for Data Science, AI & Development', 'DevOps Capstone Project', 'Introduction to Containers w/ Docker, Kubernetes & OpenShift', 'Introduction to DevOps', 'Introduction to Cloud Computing', 'Getting Started with Git and GitHub', 'Hands-on Introduction to Linux Commands and Shell Scripting', 'Application Security for Developers and DevOps Professionals', 'Continuous Integration and Continuous Delivery (CI/CD)', 'Developing AI Applications with Python and Flask', 'Application Development using Microservices and Serverless'. The specialization covers a wide range of contemporary software engineering practices, both development of deployment, both project management practices (e.g. Scrum and Test-Driven Development) and technical practices (e.g. Docker, Kubernetes, Git). High percentage grade achieved in all courses."
    }
  }
}