{
  "musings": {
    "description": "A collection of Gregor Samsa's musings, daily notes of his activities, data collections of Central European life, self-reflections, and philosophical thoughts on life, society, and the human condition.",
    "entries": [
      {
        "date": "2019-01-14",
        "content": "Woke up today feeling a bit odd. I guess that's life. Existential angst, perhaps, or could it be indigestion from last night's meal? Never explain an event with philosophy if the bodily vapours suffice. I suppose someone else already noted that aphorism. Can I ever be original? Or is this eternal recurrence? I suppose someone else already noted that aphorism. Can I ever be original?"
      },
      {
        "date": "2019-02-01",
        "content": "I created a private email today. Odd that I haven't done so before. My name is not original enough it seems, so I had to add numbers to it. Numerology was never my strong suit. As Kronecker said, 'God made the integers; all else is hogwash'. Anyways, my email is 'gregor.samsa197@gmail.com'. At least 197 is a prime number. I wonder if that means anything."
      },
      {
        "date": "2019-02-15",
        "content": "I had a strange dream last night. I was a bug. Insects have been part of my life for so long. They fascinate me. It is a little known fact in the scientific community that with a tad of light at the right frequency, one controls their behaviour and growth."
      },
      {
        "date": "2019-03-13",
        "content": "I created a LinkedIn page. Yes, I have done it. I am now more online than ever. Will I soon be nothing but a digital reflection. Signifier before the signified. God, am I turning French? Anyways, here goes, the URL to my page is 'https://www.linkedin.com/in/gregor-samsa-123456789'. I hope I get some connections soon. I wonder if I will get any endorsements. Will I find love? Or stacks of cash? But I refuse to create a personal blog. There are limits!"
      },
      {
        "date": "2019-04-01",
        "content": "Today I turned into a bug! April Fools! I am still me. But what is me? A collection of atoms, a bundle of thoughts, a series of actions? I suppose I am all of these and none of these. Does the split-brain experiment prove anything about this? Anyways, I am still me, whatever that is. Take comfort in that, Gregor."
      },
      {
        "date": "2019-04-13",
        "content": "I know lighting! Yes, I have applied more math to the spread of photons than most. And design of it is an art in the proper sense. Passionate sounds too cliche perhaps, but I am. What might the thesaurus suggest as alternative: fervent, ardent, zealous, enthusiastic, impassioned, animated, emotional, heartfelt, eager, keen, avid, dedicated, committed, devoted, fanatical, obsessed, fixated, frenzied. Here is the point: lighting is not illumination. Photons are commodity. But like money is not the paper it is printed on, lighting is not the bundle of photon comprising it. Lighting is an emergent phenomena, it is temporal, it is spatial, it is imprinted in our genetics. Yes, fire is the oldest technology, and light the first creation of our ancestors. They evolved with it. Look at your DNA, fellow human, and what do you see? Nucleic acids? Please! You see lighting, the desire for it, the love of it, the life spark, literally speaking (not in the Gen Z way, but literally literally). I know lighting. So, like whatevs, I work in the right domain, unlike most of my pepz."
      }
    ]
  }
}